---
kind: type
id: T:Autodesk.Revit.DB.LogicalOrFilter
source: html/a00da224-d330-452d-a45f-5abffa2e57e6.htm
---
# Autodesk.Revit.DB.LogicalOrFilter

A filter that contains a set of filters. The filter passes when any filter in the set passes.

## Syntax (C#)
```csharp
public class LogicalOrFilter : ElementLogicalFilter
```

## Remarks
The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.